Revit 2027 API
Document.GetCloudFolderId Method
 Gets ForgeDM folder id where the model locates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetCloudFolderId(
	bool forceRefresh
)
Public Function GetCloudFolderId (
	forceRefresh As Boolean
) As String
public:
String^ GetCloudFolderId(
	bool forceRefresh
)
member GetCloudFolderId :
        forceRefresh : bool -> string
Parameters
forceRefresh Boolean
 Cached value will be refreshed by sending a service call when forceRefresh is true.
Return Value
String
Exceptions
Exception | Condition
RevitServerUnauthorizedException |  Thrown when cannot get data from ForgeDM for Revit cloud model.
Remarks
 It is empty for non-cloud model; It is cached in Revit model opened session after getting it if forceRefresh is false; ForgeDM folder id can be changed during Revit model opened session, set forceRefresh as 'true' to get new value.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace